[
  {
    "path": "manuscripts/desaix-2019/",
    "title": "Population assignment reveals low migratory connectivity in a weakly structured songbird",
    "description": "Molecular Ecology. 2020.",
    "author": [
      {
        "name": "Matthew DeSaix",
        "url": {}
      },
      {
        "name": "Lesley Bulluck",
        "url": {}
      },
      {
        "name": "Andrew Eckert",
        "url": {}
      },
      {
        "name": "Catherine Viverette",
        "url": {}
      },
      {
        "name": "Than Boves",
        "url": {}
      },
      {
        "name": "Jessica Reese",
        "url": {}
      },
      {
        "name": "Chrisotpher Tonra",
        "url": {}
      },
      {
        "name": "Rodney Dyer",
        "url": {}
      }
    ],
    "date": "2020-02-14",
    "categories": [
      "population genetics",
      "ddradseq"
    ],
    "contents": "\n\n\nAbstract\nUnderstanding migratory connectivity is essential for determining the drivers behind population dynamics and for implementing effective conservation strategies for migratory species. Genetic markers provide a means to describe migratory connectivity; however, they can be uninformative for species with weak population genetic structure, which has limited their application. Here, we demonstrated a genomic approach to describing migratory connectivity in the prothonotary warbler, Protonotaria citrea, a Neotropical songbird of conservation concern. Using 26,189 single nucleotide polymorphisms (SNPs), we revealed regional genetic structure between the Mississippi River Valley and the Atlantic Seaboard with overall weak genetic differentiation among populations (FST = 0.0055; 95% CI: 0.0051–0.0059). Genetic variation had a stronger association with geographic rather than environmental factors, with each explaining 14.5% and 8.2% of genetic variation, respectively. By varying the numbers of genomic markers used in population assignment models with individuals of known provenance, we identified a maximum assignment accuracy (89.7% to site, 94.3% to region) using a subset of 600 highly differentiated SNPs. We then assigned samples from nonbreeding sites to breeding region and found low migratory connectivity. Our results highlight the importance of filtering markers for informative loci in models of population assignment. Quantifying migratory connectivity for weakly structured species will be useful for expanding studies to a wider range of migratory species across taxonomic groups and may contribute to a deeper understanding of the evolution of migratory strategies.\n\n\n\n",
    "preview": "manuscripts/desaix-2019/featured.jpg",
    "last_modified": "2021-12-15T06:07:59-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/ritchie-et-al-2019/",
    "title": "Wide outcrossing provides functional connectivity for new and old Banksia populations within a fragmented landscape",
    "description": "Oecologia. 2019.",
    "author": [
      {
        "name": "Alison Ritchie",
        "url": {}
      },
      {
        "name": "Rodney Dyer",
        "url": {}
      },
      {
        "name": "Paul Nevill",
        "url": {}
      },
      {
        "name": "Elizabeth Sinclair",
        "url": {}
      },
      {
        "name": "Siegfried Krauss",
        "url": {}
      }
    ],
    "date": "2019-03-27",
    "categories": [
      "population genetics",
      "gene flow",
      "genetic structure"
    ],
    "contents": "\n \n\nAbstract\nHabitat fragmentation affects landscape connectivity, the extent of which is influenced by the movement capacity of the vectors of seed and pollen dispersal for plants. Negative impacts of reduced connectivity can include reduced fecundity, increased inbreeding, genetic erosion and decreased long-term viability. These are issues for not only old (remnant) populations, but also new (restored) populations. We assessed reproductive and connective functionality within and among remnant and restored populations of a common tree, Banksia menziesii R.Br. (Proteaceae), in a fragmented urban landscape, utilising a genetic and graph theoretical approach. Adult trees and seed cohorts from five remnants and two restored populations were genotyped using microsatellite markers. Genetic variation and pollen dispersal were assessed using direct (paternity assignment) and indirect (pollination graphs and mating system characterisation) methods. Restored populations had greater allelic diversity (Ar=8.08; 8.34) than remnant populations (Ar range=6.49-7.41). Genetic differentiation was greater between restored and adjacent remnants (F-ST=0.03 and 0.10) than all other pairwise comparisons of remnant populations (mean FST=0.01 +/- 0.01; N=16 P=0.001). All populations displayed low correlated paternity (rp=0.06-0.16) with wide-ranging realised pollen dispersal distances (<1.7km) and well-connected pollen networks. Here, we demonstrate reproductive and connective functionality of old and new populations of B. menziesii within a fragmented landscape. Due to long-distance pollination events, the physical size of these sites underestimates their effective population size. Thus, they are functionally equivalent to large populations, integrated into a larger landscape matrix.\n\n\n\n",
    "preview": "manuscripts/ritchie-et-al-2019/featured.png",
    "last_modified": "2021-12-15T06:09:01-05:00",
    "input_file": {},
    "preview_width": 785,
    "preview_height": 726
  },
  {
    "path": "manuscripts/friedline-et-al-2019/",
    "title": "Evolutionary genomics of gypsy moth populations sampled along a latitudinal gradient",
    "description": "Molecular Ecology. 2019.",
    "author": [
      {
        "name": "Christopher Friedline",
        "url": {}
      },
      {
        "name": "Trevor Faske",
        "url": {}
      },
      {
        "name": "Brandon Lind",
        "url": {}
      },
      {
        "name": "Erin Hobson",
        "url": {}
      },
      {
        "name": "Dylan Parry",
        "url": {}
      },
      {
        "name": "Rodney Dyer",
        "url": {}
      },
      {
        "name": "Derek Johson",
        "url": {}
      },
      {
        "name": "Lilly Thompson",
        "url": {}
      },
      {
        "name": "Kristine Grayson",
        "url": {}
      },
      {
        "name": "Andrew Eckert",
        "url": {}
      }
    ],
    "date": "2019-03-04",
    "categories": [
      "population genetics",
      "ddradseq",
      "gypsy moth"
    ],
    "contents": "\n \nAbstract\nThe European gypsy moth (Lymantria dispar L.) was first introduced to Massachusetts in 1869 and within 150 years has spread throughout eastern North America. This large‐scale invasion across a heterogeneous landscape allows examination of the genetic signatures of adaptation potentially associated with rapid geographical spread. We tested the hypothesis that spatially divergent natural selection has driven observed changes in three developmental traits that were measured in a common garden for 165 adult moths sampled from six populations across a latitudinal gradient covering the entirety of the range. We generated genotype data for 91,468 single nucleotide polymorphisms based on double digest restriction‐site associated DNA sequencing and used these data to discover genome‐wide associations for each trait, as well as to test for signatures of selection on the discovered architectures. Genetic structure across the introduced range of gypsy moth was low in magnitude (FST = 0.069), with signatures of bottlenecks and spatial expansion apparent in the rare portion of the allele frequency spectrum. Results from applications of Bayesian sparse linear mixed models were consistent with the presumed polygenic architectures of each trait. Further analyses indicated spatially divergent natural selection acting on larval development time and pupal mass, with the linkage disequilibrium component of this test acting as the main driver of observed patterns. The populations most important for these signals were two range‐edge populations established less than 30 generations ago. We discuss the importance of rapid polygenic adaptation to the ability of non‐native species to invade novel environments.\n\n\n\n",
    "preview": "manuscripts/friedline-et-al-2019/featured.jpg",
    "last_modified": "2021-12-15T06:08:33-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/flores-manzanero-et-al-2019/",
    "title": "Functional connectivity and home range inferred at a microgeographic landscape genetics scale in a desert-dwelling rodent",
    "description": "ECOLOGY AND EVOLUTION. 2019.",
    "author": [
      {
        "name": "Alejandro Flores-Manzanero",
        "url": {}
      },
      {
        "name": "Madisson A. Luna-Barcenas",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "Ella Vazquez-Dominguez",
        "url": {}
      }
    ],
    "date": "2019-01-01",
    "categories": [
      "desert ecosystems",
      "dipodomys merriami",
      "functional connectivity",
      "landscape genetics",
      "merriam's kangaroo rat",
      "resistance surfaces"
    ],
    "contents": "\n \n\n\nAbstract\nGene flow in animals is limited or facilitated by different features within the landscape matrix they inhabit. The landscape representation in landscape genetics (LG) is traditionally modeled as resistance surfaces (RS), where novel optimization approaches are needed for assigning resistance values that adequately avoid subjectivity. Also, desert ecosystems and mammals are scarcely represented in LG studies. We addressed these issues by evaluating, at a microgeographic scale, the effect of landscape features on functional connectivity of the desert-dwelling Dipodomys merriami. We characterized genetic diversity and structure with microsatellites loci, estimated home ranges and movement of individuals using telemetry-one of the first with rodents, generated a set of individual and composite environmental surfaces based on hypotheses of variables influencing movement, and assessed how these variables relate to individual-based gene flow. Genetic diversity and structure results evidenced a family-induced pattern driven by first-order-related individuals, notably determining landscape genetic inferences. The vegetation cover and soil resistance optimized surface (NDVI) were the best-supported model and a significant predictor of individual genetic distance, followed by humidity and NDVI+humidity. Based on an accurate definition of thematic resolution, we also showed that vegetation is better represented as continuously (vs. categorically) distributed. Hence, with a nonsubjective optimization framework for RS and telemetry, we were able to describe that vegetation cover, soil texture, and climatic variables influence D. merriami’s functional connectivity at a microgeographic scale, patterns we could further explain based on the home range, habitat use, and activity observed between sexes. We describe the relationship between environmental features and some aspects of D. merriami’s behavior and physiology.\n\n\n\n",
    "preview": "manuscripts/flores-manzanero-et-al-2019/featured.jpg",
    "last_modified": "2021-12-15T06:08:29-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/chan-lee-dyer-2018/",
    "title": "Comparison of Pollination Graphs",
    "description": "MOLECULAR ECOLOGY. 2018.",
    "author": [
      {
        "name": "James H. Lee",
        "url": {}
      },
      {
        "name": "David M. Chan",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2018-08-01",
    "categories": [
      "pollination network",
      "correlated random walk",
      "agent-based model",
      "pollen carryover",
      "tree density"
    ],
    "contents": "\n \n\nAbstract\nFrom the agent-based, correlated random walk model presented, we observe theeffects of varying the maximum turning angle, δmax, tree density, ω, and pollen carryover, κmax, on the distribution of pollen within a tree population by examining pollination graphs. Varying maximum turning angle and pollen carryover alters the dispersal of pollen, which affects many measures of connectivity of the pollination graph. Among these measures the clustering coefficient of fathers is largest when δmax is between 60 and 90∘ . The greatest effect of varying ω is not on the clustering coefficient of fathers, but on the other measures of genetic diversity. In particular when comparing simulations with randomly placed trees with that of actual tree placement of C. florida at the VCU Rice Center, it is clear that having specific tree locations is crucial in determining the properties of a pollination graph.\n\n\n\n",
    "preview": "manuscripts/chan-lee-dyer-2018/featured.png",
    "last_modified": "2021-12-15T06:07:55-05:00",
    "input_file": {},
    "preview_width": 768,
    "preview_height": 468
  },
  {
    "path": "manuscripts/miles-et-al-2018-mol-ecol/",
    "title": "Urbanization as a facilitator of gene flow in a human health pest",
    "description": "MOLECULAR ECOLOGY. 2018.",
    "author": [
      {
        "name": "Lindsay S. Miles",
        "url": {}
      },
      {
        "name": "J. Chadwick Johnson",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "Brian C. Verrelli",
        "url": {}
      }
    ],
    "date": "2018-08-01",
    "categories": [
      "pest",
      "popgraph",
      "social network",
      "spider",
      "urban facilitation"
    ],
    "contents": "\n \n\nAbstract\nUrban fragmentation can reduce gene flow that isolates populations, reduces genetic diversity and increases population differentiation, all of which have negative conservation implications. Alternatively, gene flow may actually be increased among urban areas consistent with an urban facilitation model. In fact, urban adapter pests are able to thrive in the urban environment and may be experiencing human-mediated transport. Here, we used social network theory with a population genetic approach to investigate the impact of urbanization on genetic connectivity in the Western black widow spider, as an urban pest model of human health concern. We collected genomewide single nucleotide polymorphism variation from mitochondrial and nuclear double-digest RAD (ddRAD) sequence data sets from 210 individuals sampled from 11 urban and 10 nonurban locales across its distribution of the Western United States. From urban and nonurban contrasts of population, phylogenetic, and network analyses, urban locales have higher within-population genetic diversity, lower between-population genetic differentiation and higher estimates of genetic connectivity. Social network analyses show that urban locales not only have more connections, but can act as hubs that drive connectivity among nonurban locales, which show signatures of historical isolation. These results are consistent with an urban facilitation model of gene flow and demonstrate the importance of sampling multiple cities and markers to identify the role that urbanization has had on larger spatial scales. As the urban landscape continues to grow, this approach will help determine what factors influence the spread and adaptation of pests, like the venomous black widow spider, in building policies for human and biodiversity health.\n\n\n\n",
    "preview": "manuscripts/miles-et-al-2018-mol-ecol/featured.png",
    "last_modified": "2021-12-15T06:08:57-05:00",
    "input_file": {},
    "preview_width": 768,
    "preview_height": 477
  },
  {
    "path": "manuscripts/miles-et-al-2019-proc-roy-soc/",
    "title": "Urban hubs of connectivity: contrasting patterns of gene flow within and among cities in the western black widow spider",
    "description": "PROCEEDINGS OF THE ROYAL SOCIETY B-BIOLOGICAL SCIENCES. 2018.",
    "author": [
      {
        "name": "Lindsay S. Miles",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "Brian C. Verrelli",
        "url": {}
      }
    ],
    "date": "2018-08-01",
    "categories": [
      "urbanization",
      "genetic connectivity",
      "population genetics",
      "urban pest"
    ],
    "contents": "\n \n\nAbstract\nAs urbanization drastically alters the natural landscape and generates novel habitats within cities, the potential for changes to gene flow for urban-dwelling species increases. The western black widow spider (Latrodectus hesperus) is a medically relevant urban adapter pest species, for which we have previously identified population genetic signatures consistent with urbanization facilitating gene flow, likely due to human-mediated transport. Here, in an analysis of 1.9 million genome-wide SNPs, we contrast broad-scale geographical analyses of 10 urban and 11 non-urban locales with fine-scale within-city analyses including 30 urban locales across the western USA. These hierarchical datasets enable us to test hypotheses of how urbanization impacts multiple urban cities and their genetic connectivity at different spatial scales. Coupled fine-scale and broad-scale analyses reveal contrasting patterns of high and low genetic differentiation among locales within cities as a result of low and high genetic connectivity, respectively, of these cities to the overall population network. We discuss these results as they challenge the use of cities as replicates of urban eco-evolution, and have implications for conservation and human health in a rapidly growing urban habitat.\n\n\n\n",
    "preview": "manuscripts/miles-et-al-2019-proc-roy-soc/featured.png",
    "last_modified": "2021-12-15T06:08:59-05:00",
    "input_file": {},
    "preview_width": 300,
    "preview_height": 272
  },
  {
    "path": "manuscripts/cushman-et-al-2018/",
    "title": "Editorial: The Least Cost Path From Landscape Genetics to Landscape Genomics: Challenges and Opportunities to Explore NGS Data in a Spatially Explicit Context",
    "description": "FRONTIERS IN GENETICS. 2018.",
    "author": [
      {
        "name": "Samuel A. Cushman",
        "url": {}
      },
      {
        "name": "Andrew J. Shirk",
        "url": {}
      },
      {
        "name": "Glenn T. Howe",
        "url": {}
      },
      {
        "name": "Melanie A. Murphy",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "Stephane Joost",
        "url": {}
      }
    ],
    "date": "2018-06-01",
    "categories": [
      "landscape genetics",
      "landscape genomics",
      "next generation sequencing",
      "spatial genetics",
      "ecological genetics"
    ],
    "contents": "\n \n\nAbstract\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:07:57-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/watts-dyer-2018/",
    "title": "Structure and Resilience of Bald Eagle Roost Networks",
    "description": "WILDLIFE SOCIETY BULLETIN. 2018.",
    "author": [
      {
        "name": "Bryan D. Watts",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2018-06-01",
    "categories": [
      "bald eagle",
      "chesapeake bay",
      "communal roost",
      "haliaeetus leucocephalus",
      "networks",
      "resiliency"
    ],
    "contents": "\n\n\nAbstract\nThe recognition that communal roosts are important elements within the life cycle of bald eagles (Haliaeetus leucocephalus) led to their protection under the ``disturb″ clause of the Bald and Golden Eagle Protection Act. The regular roost-switching movements of bald eagles imply that roosts are part of an interactive network where roosts represent nodes linked by birds moving between them. Network analysis holds promise for informing management decisions by assessing the effect of roost removal on the resilience of the broader network. We tracked nonbreeding bald eagles (n = 56) within the upper Chesapeake Bay (2008-2013), USA, to evaluate roost characteristics and network structure. We used midnight locations (n = 14,464) to assess the use of communal roosts (n = 212) and movement of birds among roosts (n = 2,634) on successive roost nights to evaluate the pattern and strength of connections. We performed a sensitivity analysis to assess the response of the roost network to roost loss. Structure of the roost network approximated that of a scale-free network where the distribution of connections follows a power law of the form P(k)=Ak(-gamma) and gamma = 1.1. Unlike random networks, connections within scale-free networks are concentrated within a few highly connected nodes (hubs). These hub roosts serve as bridges between large numbers of other roosts, have the shortest travel times to other roosts and greatest overall influence on network functioning. The effect of roost removal on overall network function was directly proportional to the connectivity of the roost being removed. The targeted removal of the majority (>90%) of roosts had very little effect on the network. Network sensitivity was high in response to the loss of roosts within the highest 10% of connectivity. This small (n = 18) subset of roosts makes a disproportionate contribution to network function and the protection of these roosts should be a stated management objective with high priority. Network analysis represents a powerful tool with the potential to inform management decisions. (C) 2018 The Wildlife Society.\n\n\n\n",
    "preview": "manuscripts/watts-dyer-2018/featured.png",
    "last_modified": "2021-12-15T06:09:14-05:00",
    "input_file": {},
    "preview_width": 768,
    "preview_height": 593
  },
  {
    "path": "manuscripts/bertrand-et-al-2017/",
    "title": "Sex-specific graphs: Relating group-specific topology to demographic and landscape data",
    "description": "MOLECULAR ECOLOGY. 2017.",
    "author": [
      {
        "name": "Philip Bertrand",
        "url": {}
      },
      {
        "name": "Jeff Bowman",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "Micheline Manseau",
        "url": {}
      },
      {
        "name": "Paul J. Wilson",
        "url": {}
      }
    ],
    "date": "2017-08-01",
    "categories": [
      "genetic network",
      "pekania pennanti",
      "population graph",
      "sex-biased dispersal",
      "sex-specific graphs"
    ],
    "contents": "\n \n\nAbstract\nSex-specific genetic structure is a commonly observed pattern among vertebrate species. Facing differential selective pressures, individuals may adopt sex-specific life history traits that ultimately shape genetic variation among populations. Although differential dispersal dynamics are commonly detected in the literature, few studies have used genetic structure to investigate sex-specific functional connectivity. The recent use of graph theoretic approaches in landscape genetics has demonstrated network capacities to describe complex system behaviours where network topology represents genetic interaction among subunits. Here, we partition the overall genetic structure into sex-specific graphs, revealing different male and female dispersal dynamics of a fisher (Pekania [Martes] pennanti) metapopulation in southern Ontario. Our analyses based on network topologies supported the hypothesis of male-biased dispersal. Furthermore, we demonstrated that the effect of the landscape, identified at the population level, could be partitioned among sex-specific strata. We found that female connectivity was negatively correlated with snow depth, whereas connectivity among males was not. Our findings underscore the potential of conducting sex-specific analysis by identifying landscape elements or configuration that differentially promotes or impedes functional connectivity between sexes, revealing processes that may otherwise remain cryptic. We propose that the sex-specific graph approach would be applicable to other vagile species where differential sex-specific processes are expected to occur.\n\n\n\n",
    "preview": "manuscripts/bertrand-et-al-2017/featured.png",
    "last_modified": "2021-12-15T06:07:53-05:00",
    "input_file": {},
    "preview_width": 370,
    "preview_height": 730
  },
  {
    "path": "manuscripts/foster-chan-dyer-2016/",
    "title": "Model Comparison for Abiotic versus Biotic Pollen Dispersal",
    "description": "NONLINEAR DYNAMICS PSYCHOLOGY AND LIFE SCIENCES. 2016.",
    "author": [
      {
        "name": "Erich L. Foster",
        "url": {}
      },
      {
        "name": "David M. Chan",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2016-10-01",
    "categories": [
      "gene flow",
      "agent based modelling",
      "correlated random walk",
      "pollen"
    ],
    "contents": "\n\n\nAbstract\nAn agent-based model with a correlated random walk is used to explore pollination within a forest. For abiotic dispersal, say via the wind, we use a purely random walk where there is no correlation between consecutive steps and for biotic dispersal, say via insect, we use a moderate or highly correlated random walk. In particular, we examine the differences in a number of biological measurement between a purely random walk and a correlated random walk in terms of gene dispersal in low and high plant densities.\n\n\n\n",
    "preview": "manuscripts/foster-chan-dyer-2016/featured.png",
    "last_modified": "2021-12-15T06:08:31-05:00",
    "input_file": {},
    "preview_width": 300,
    "preview_height": 257
  },
  {
    "path": "manuscripts/tucker-et-al-2016/",
    "title": "Opportunistic conspecific brood parasitism in a box-nesting population of Prothonotary Warblers (Protonotaria citrea)",
    "description": "AUK. 2016.",
    "author": [
      {
        "name": "Anna M. Tucker",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "Sarah K. Huber",
        "url": {}
      },
      {
        "name": "Lesley P. Bulluck",
        "url": {}
      }
    ],
    "date": "2016-04-01",
    "categories": [
      "breeding ecology",
      "cavity nesters",
      "conspecific brood parasitism",
      "protonotaria citrea"
    ],
    "contents": "\n \n\nAbstract\nConspecific brood parasitism (CBP), although prevalent in some avian taxa, is easily overlooked when it occurs in low frequencies, and therefore the ecology of this behavior has only occasionally been described in passerines. We describe the occurrence of CBP in a population of Prothonotary Warblers (Protonotaria citrea) breeding in nest boxes, demonstrate associated fitness costs, and investigate parasite strategy. We genotyped individuals at 6 microsatellite loci and used Cervus software to determine log-likelihood of maternity (LOD scores) for offspring and social mothers. We set critical cutoff LOD scores at 95% confidence for exclusion of the social mother and assignment of a parasite mother from the breeding population. Of 805 nestlings (233 family groups during 2009-2013), we found that 12.7% had genotypes that were incompatible with their social mother. Females with unrelated nestlings (hosts) fledged fewer biological offspring within the host year than nonhost females despite fledging more total offspring, but being a host was not significantly associated with total reproductive success over 5 yr of breeding. We were able to identify only similar to 30% of parasite females, which suggests that the majority of parasites may be floaters (i.e. non-nesters) in the population or nesting in nearby natural cavities. We found no evidence of host selection based on host age, arrival at the breeding site, or nest-box productivity in the previous year. This opportunistic behavior is likely facilitated by the nesting ecology of this population, in that nest sites are limited, conspicuous, and relatively dense. Future studies investigating CBP in populations using natural cavities can help elucidate the drivers of this behavior.\n\n\n\n",
    "preview": "manuscripts/tucker-et-al-2016/featured.png",
    "last_modified": "2021-12-15T06:09:11-05:00",
    "input_file": {},
    "preview_width": 641,
    "preview_height": 818
  },
  {
    "path": "manuscripts/dyer-2015-AREES/",
    "title": "Population Graphs and Landscape Genetics",
    "description": "ANNUAL REVIEW OF ECOLOGY, EVOLUTION, AND SYSTEMATICS. 2015.",
    "author": [
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2015-10-06",
    "categories": [
      "landscape genetics",
      "population graphs",
      "spatial structure",
      "connectivity"
    ],
    "contents": "\n \n\nAbstract\nAt the heart of the analyses of landscape genetics are isolation models seeking to explain either interindividual or interpopulation connectivity. These models use spatial, ecological, and topographic predictor variables measured between sites in an attempt to explain observed genetic variation. During the past decade, these models have adopted an increasingly sophisticated set of techniques to quantify intervening physical and ecological spaces, although they are restrained by rather mundane approaches to characterizing the genetic components of connectivity. Population Graphs are one approach to improving the quantification of genetic covariance used in models of landscape genetics. I explain the construction of the Population Graph framework, explain its strengths and weaknesses, and provide examples of how it has been used during the past decade within the contexts of landscape and population genetics.\n\n\n\n",
    "preview": "manuscripts/dyer-2015-AREES/featured.png",
    "last_modified": "2021-12-15T06:08:13-05:00",
    "input_file": {},
    "preview_width": 300,
    "preview_height": 209
  },
  {
    "path": "manuscripts/yang-et-al-2015/",
    "title": "Genetic structure of Pinus henryi and Pinus tabuliformis: Natural landscapes as significant barriers to gene flow among populations",
    "description": "BIOCHEMICAL SYSTEMATICS AND ECOLOGY. 2015.",
    "author": [
      {
        "name": "Lu Yang",
        "url": {}
      },
      {
        "name": "Zhan-Lin Liu",
        "url": {}
      },
      {
        "name": "Jianfang Li",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2015-08-01",
    "categories": [
      "cpssr",
      "genetic structure",
      "geographical boundary",
      "pinus henryi",
      "pinus tabuliformis"
    ],
    "contents": "\n \nAbstract\nMountains as natural barriers often have important effects on intraspecific genetic structure through restraining gene flow and enhancing differentiation among populations. While the Qinling and Daba mountains are considered significant geographic barriers, dividing China into temperate and subtropical regions, little is known about how this barrier influences the genetic patterns of sister species represented in distinct habitats. In this study, we analyzed genetic differentiation and the geographic boundary between Pinus henryi and Pinus tabuliformis using chloroplast microsatellite markers. Our data show high levels of among-population differentiation, consistent with the effects of historical demographic bottlenecks, local adaptation and climate effects. Three main geographic boundaries coinciding with mountain systems indicate natural landscapes, such as large rivers, and habitat loss caused by anthropogenic deforestation, are significant barriers to genetic exchange among populations. The divergence between populations in the eastern and western Qinling Mountains populations may possibly be ascribed to fragmentation driven by climate change. The genetic boundary of P. henryi and P. tabuliformis generally coincides with the previous morphological dividing line based on the unweighted pair group method using arithmetic averages and on spatial analysis of molecular variance. (C) 2015 Elsevier Ltd. All rights reserved.\n\n\n\n",
    "preview": "manuscripts/yang-et-al-2015/featured.png",
    "last_modified": "2021-12-15T06:09:17-05:00",
    "input_file": {},
    "preview_width": 768,
    "preview_height": 474
  },
  {
    "path": "manuscripts/dyer-2015/",
    "title": "Is there such a thing as landscape genetics?",
    "description": "MOLECULAR ECOLOGY. 2015.",
    "author": [
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2015-07-01",
    "categories": [
      "landscape genetics",
      "landscape ecology",
      "population genetics"
    ],
    "contents": "\n \n\nAbstract\nFor a scientific discipline to be interdisciplinary, it must satisfy two conditions; it must consist of contributions from at least two existing disciplines, and it must be able to provide insights, through this interaction, that neither progenitor discipline could address. In this study, I examine the complete body of peer-reviewed literature self-identified as landscape genetics (LG) using the statistical approaches of text mining and natural language processing. The goal here was to quantify the kinds of questions being addressed in LG studies, the ways in which questions are evaluated mechanistically, and how they are differentiated from the progenitor disciplines of landscape ecology and population genetics. I then circumscribe the main factions within published LG studies examining the extent to which emergent questions are being addressed and highlighting a deep bifurcation between existing individual - and population-based approaches. I close by providing some suggestions on where theoretical and analytical work is needed if LGs is to serve as a real bridge connecting evolution and ecology sensu lato.\n\n\n\n",
    "preview": "manuscripts/dyer-2015/featured.png",
    "last_modified": "2021-12-15T06:08:15-05:00",
    "input_file": {},
    "preview_width": 300,
    "preview_height": 242
  },
  {
    "path": "manuscripts/garrick-et-al-2015/",
    "title": "Identification of Eastern United States Reticulitermes Termite Species via PCR-RFLP, Assessed Using Training and Test Data",
    "description": "INSECTS. 2015.",
    "author": [
      {
        "name": "Ryan C. Garrick",
        "url": {}
      },
      {
        "name": "Benjamin D. Collins",
        "url": {}
      },
      {
        "name": "Rachel N. Yi",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "Chaz Hyseni",
        "url": {}
      }
    ],
    "date": "2015-06-01",
    "categories": [],
    "contents": "\n \n\nAbstract\nReticulitermes termites play key roles in dead wood decomposition and nutrient cycling in forests. They also damage man-made structures, resulting in considerable economic loss. In the eastern United States, five species (R. flavipes, R. virginicus, R. nelsonae, R. hageni and R. malletei) have overlapping ranges and are difficult to distinguish morphologically. Here we present a molecular tool for species identification. It is based on polymerase chain reaction (PCR) amplification of a section of the mitochondrial cytochrome oxidase subunit II gene, followed by a three-enzyme restriction fragment length polymorphism (RFLP) assay, with banding patterns resolved via agarose gel electrophoresis. The assay was designed using a large set of training data obtained from a public DNA sequence database, then evaluated using an independent test panel of Reticulitermes from the Southern Appalachian Mountains, for which species assignments were determined via phylogenetic comparison to reference sequences. After refining the interpretive framework, the PCR-RFLP assay was shown to provide accurate identification of four co-occurring species (the fifth species, R. hageni, was absent from the test panel, so accuracy cannot yet be extended to training data). The assay is cost- and time-efficient, and will help improve knowledge of Reticulitermes species distributions.\n\n\n\n",
    "preview": "manuscripts/garrick-et-al-2015/featured.png",
    "last_modified": "2021-12-15T06:08:50-05:00",
    "input_file": {},
    "preview_width": 666,
    "preview_height": 871
  },
  {
    "path": "manuscripts/di-leo-et-al-2014/",
    "title": "The gravity of pollination: integrating at-site features into spatial analysis of contemporary pollen movement",
    "description": "MOLECULAR ECOLOGY. 2014.",
    "author": [
      {
        "name": "Michelle F. Dileo",
        "url": {}
      },
      {
        "name": "Jenna C. Siu",
        "url": {}
      },
      {
        "name": "Matthew K. Rhodes",
        "url": {}
      },
      {
        "name": "Adriana Lopez-Villalobos",
        "url": {}
      },
      {
        "name": "Angela Redwine",
        "url": {}
      },
      {
        "name": "Kelly Ksiazek",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2014-08-01",
    "categories": [
      "cornus florida",
      "gene flow",
      "gravity models",
      "landscape genetics",
      "population graphs"
    ],
    "contents": "\n \n\nAbstract\nPollen-mediated gene flow is a major driver of spatial genetic structure in plant populations. Both individual plant characteristics and site-specific features of the landscape can modify the perceived attractiveness of plants to their pollinators and thus play an important role in shaping spatial genetic variation. Most studies of landscape-level genetic connectivity in plants have focused on the effects of interindividual distance using spatial and increasingly ecological separation, yet have not incorporated individual plant characteristics or other at-site ecological variables. Using spatially explicit simulations, we first tested the extent to which the inclusion of at-site variables influencing local pollination success improved the statistical characterization of genetic connectivity based upon examination of pollen pool genetic structure. The addition of at-site characteristics provided better models than those that only considered interindividual spatial distance (e.g. IBD). Models parameterized using conditional genetic covariance (e.g. population graphs) also outperformed those assuming panmixia. In a natural population of Cornus florida L. (Cornaceae), we showed that the addition of at-site characteristics (clumping of primary canopy opening above each maternal tree and maternal tree floral output) provided significantly better models describing gene flow than models including only between-site spatial (IBD) and ecological (isolation by resistance) variables. Overall, our results show that including interindividual and local ecological variation greatly aids in characterizing landscape-level measures of contemporary gene flow.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:08:04-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/sork-et-al-2013/",
    "title": "Putting the landscape into the genomics of trees: approaches for understanding local adaptation and population responses to changing climate",
    "description": "TREE GENETICS & GENOMES. 2013.",
    "author": [
      {
        "name": "Victoria L. Sork",
        "url": {}
      },
      {
        "name": "Sally N. Aitken",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "Andrew J. Eckert",
        "url": {}
      },
      {
        "name": "Pierre Legendre",
        "url": {}
      },
      {
        "name": "Dave B. Neale",
        "url": {}
      }
    ],
    "date": "2013-08-01",
    "categories": [
      "adaptive genetic variation",
      "climate change",
      "environmental association",
      "forest genetics",
      "genomics",
      "landscape genetics"
    ],
    "contents": "\n \n\nAbstract\nThe Forest ecosystem genomics Research: supporTing Transatlantic Cooperation project (FoResTTraC, http://www.foresttrac.eu/) sponsored a workshop in August 2010 to evaluate the potential for using a landscape genomics approach for studying plant adaptation to the environment and the potential of local populations for coping with changing climate. This paper summarizes our discussions and articulates a vision of how we believe forest trees offer an unparalleled opportunity to address fundamental biological questions, as well as how the application of landscape genomic methods complement to traditional forest genetic approaches that provide critical information needed for natural resource management. In this paper, we will cover four topics. First, we begin by defining landscape genomics and briefly reviewing the unique situation for tree species in the application of this approach toward understanding plant adaptation to the environment. Second, we review traditional approaches in forest genetics for studying local adaptation and identifying loci underlying locally adapted phenotypes. Third, we present existing and emerging methods available for landscape genomic analyses. Finally, we briefly touch on how these approaches can aid in understanding practical topics such as management of tree populations facing climate change.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:09:10-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/garrick-et-al-2013/",
    "title": "Ecological coassociations influence species' responses to past climatic change: an example from a Sonoran Desert bark beetle",
    "description": "MOLECULAR ECOLOGY. 2013.",
    "author": [
      {
        "name": "Ryan C. Garrick",
        "url": {}
      },
      {
        "name": "John D. Nason",
        "url": {}
      },
      {
        "name": "Juan F. Fernandez-Manjarres",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2013-06-01",
    "categories": [
      "baja california",
      "coleoptera",
      "landscape history",
      "population genetics",
      "range expansion",
      "vicariance"
    ],
    "contents": "\n \n\nAbstract\nEcologically interacting species may have phylogeographical histories that are shaped both by features of their abiotic landscape and by biotic constraints imposed by their coassociation. The Baja California peninsula provides an excellent opportunity to examine the influence of abiotic vs. biotic factors on patterns of diversity in plant-insect species. This is because past climatic and geological changes impacted the genetic structure of plants quite differently to that of codistributed free-living animals (e.g. herpetofauna and small mammals). Thus, plant-like’ patterns should be discernible in host-specific insect herbivores. Here, we investigate the population history of a monophagous bark beetle, Araptus attenuatus, and consider drivers of phylogeographical patterns in the light of previous work on its host plant, Euphorbia lomelii. Using a combination of phylogenetic, coalescent-simulation-based and exploratory analyses of mitochondrial DNA sequences and nuclear genotypic data, we found that the evolutionary history of A.attenuatus exhibits similarities to its host plant that are attributable to both biotic and abiotic processes. Southward range expansion and recent colonization of continental Sonora from the Baja peninsula appear to be unique to this taxon pair and probably reflect influences of the host plant. On the other hand, abiotic factors with landscape-level influences on a diverse suite of codistributed arid-adapted taxa, such as Plio- and Pleistocene-aged marine incursions in the region, also left genetic signatures in beetle and host plant populations. Superimposed on these similarities, bark beetle-specific patterns and processes were also evident: our data revealed two secondarily sympatric, reproductively isolated genetic lineages, as well as a previously unrecognized mid-peninsular warm desert refuge. Taken together, this work illustrates that the evolutionary history of species-specific insect herbivores may represent a mosaic of influences, includingbut not limited tothose imposed by the host plant.\n\n\n\n",
    "preview": "manuscripts/garrick-et-al-2013/featured.png",
    "last_modified": "2021-12-15T06:08:48-05:00",
    "input_file": {},
    "preview_width": 539,
    "preview_height": 612
  },
  {
    "path": "manuscripts/eckert-dyer-2012/",
    "title": "Defining the landscape of adaptive genetic diversity",
    "description": "MOLECULAR ECOLOGY. 2012.",
    "author": [
      {
        "name": "Andrew J. Eckert",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2012-06-01",
    "categories": [
      "adaptive traits",
      "conifers",
      "fitness landscape",
      "genome-wide association",
      "serotiny"
    ],
    "contents": "\n \n\nAbstract\nWhether they are used to describe fitness, genome architecture or the spatial distribution of environmental variables, the concept of a landscape has figured prominently in our collective reasoning. The tradition of landscapes in evolutionary biology is one of fitness mapped onto axes defined by phenotypes or molecular sequence states. The characteristics of these landscapes depend on natural selection, which is structured across both genomic and environmental landscapes, and thus, the bridge among differing uses of the landscape concept (i.e. metaphorically or literally) is that of an adaptive phenotype and its distribution across geographical landscapes in relation to selective pressures. One of the ultimate goals of evolutionary biology should thus be to construct fitness landscapes in geographical space. Natural plant populations are ideal systems with which to explore the feasibility of attaining this goal, because much is known about the quantitative genetic architecture of complex traits for many different plant species. What is less known are the molecular components of this architecture. In this issue of Molecular Ecology, Parchman (2012) pioneer one of the first truly genome-wide association studies in a tree that moves us closer to this form of mechanistic understanding for an adaptive phenotype in natural populations of lodgepole pine (Pinus contorta Dougl. ex Loud.).\n\n\n\n",
    "preview": "manuscripts/eckert-dyer-2012/featured.png",
    "last_modified": "2021-12-15T06:08:26-05:00",
    "input_file": {},
    "preview_width": 314,
    "preview_height": 237
  },
  {
    "path": "manuscripts/dyer-et-al-2012/",
    "title": "Pollination graphs: quantifying pollen pool covariance networks and the influence of intervening landscape on genetic connectivity in the North American understory tree, Cornus florida L.",
    "description": "LANDSCAPE ECOLOGY. 2012.",
    "author": [
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "David M. Chan",
        "url": {}
      },
      {
        "name": "Vicki A. Gardiakos",
        "url": {}
      },
      {
        "name": "Crystal A. Meadows",
        "url": {}
      }
    ],
    "date": "2012-02-01",
    "categories": [
      "pollination graph",
      "connectivity",
      "conditional genetic distance",
      "gene flow",
      "cornus florida"
    ],
    "contents": "\n \n\nAbstract\nThe manner by which pollinators move across a landscape and their resulting preferences and/or avoidances of travel through particular habitat types can have a significant impact on plant population genetic structure and population-level connectivity. We examined the spatial genetic structure of the understory tree Cornus florida (Cornaceae) adults (N-Adults = 452) and offspring (N-Offspring = 736) across two mating events to determine the extent to which pollen pool genetic covariance is influenced by intervening forest architecture. Resident adults showed no spatial partitioning but genotypes were positively autocorrelated up to a distance of 35 m suggesting a pattern of restricted seed dispersal. In the offspring, selfing rates were small (s(m) = 0.035) whereas both biparental inbreeding (s(b;open) (canopy) = 0.16, s(b;closed canopy) = 0.11) and correlated paternity (r(p;open canopy) = 0.21, r(p;closed canopy) = 0.07) were significantly influenced by primary canopy opening above individual mothers. The spatial distribution of genetic covariance in pollen pool composition was quantified for each reproductive event using Pollination Graphs, a network method based upon multivariate conditional genetic covariance. The georeferenced graph topology revealed a significant positive relationship between genetic covariance and pollinator movement through C. florida canopies, a negative relationship with open primary canopy (e. g., roads under open canopies and fields with no primary canopy), and no relationship with either conifer or mixed hardwood canopy species cover. These results suggest that both resident genetic structure within stands and genetic connectivity between sites in C. florida populations are influenced by spatial heterogeneity of mating individuals and quality of intervening canopy cover.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:08:21-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/kluetsch-dyer-misof-2012/",
    "title": "Combining multiple analytical approaches for the identification of population structure and genetic delineation of two subspecies of the endemic Arabian burnet moth Reissita simonyi (Zygaenidae; Lepidoptera)",
    "description": "CONSERVATION GENETICS. 2012.",
    "author": [
      {
        "name": "Cornelya F.C. Kluetsch",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "B. Misof",
        "url": {}
      }
    ],
    "date": "2012-02-01",
    "categories": [
      "reissita simonyi",
      "microsatellites",
      "isolatuion by distance",
      "isolatuion by altitude",
      "landscape connectivity",
      "null alleles"
    ],
    "contents": "\n \n\nAbstract\nHabitat fragmentation and landscape topology may influence the genetic structure and connectivity between natural populations. Six microsatellite loci were used to infer the population structure of 35 populations (N = 788) of the alpine Arabian burnet moth Reissita simonyi (Lepidoptera, Zygaenidae) in Yemen and Oman. Due to the patchy distribution of larval food plants, R. simonyi is not continuously distributed throughout the studied area and the two recognized subspecies of this endemic species (Reissita s. simonyi/R. s. yemenicola) are apparently discretely distributed. All microsatellites showed prevalence of null alleles and therefore a thorough investigation of the impact of null alleles on different population genetic parameters (F-ST, inbreeding coefficients, and Population Graph topologies) is given. In general, null alleles reduced genetic covariance and independence of allele frequencies resulting in a more connected genetic topology in Population Graphs and an overestimation of pairwise F-ST values and inbreeding coefficients. Despite the presence of null alleles, Population Graphs also showed a much higher genetic connectivity within subspecies (and lower genetic differentiation (via F-ST)) than between; supporting existing taxonomic distinction. Partial Mantel tests showed that both geographical distance and altitude were highly correlated with the observed distribution of genetic structure within R. simonyi. In conclusion, we identified geographical and altitudinal distances in R. simonyi as well as an intervening desert area to be the main factors for spatial genetic structure in this species and show that the taxonomic division into two subspecies is confirmed by genetic analysis.\n\n\n\n",
    "preview": "manuscripts/kluetsch-dyer-misof-2012/featured.png",
    "last_modified": "2021-12-15T06:08:55-05:00",
    "input_file": {},
    "preview_width": 501,
    "preview_height": 482
  },
  {
    "path": "manuscripts/baker-dyer-2011/",
    "title": "Invasion genetics of Microstegium vimineum (Poaceae) within the James River Basin of Virginia, USA",
    "description": "CONSERVATION GENETICS. 2011.",
    "author": [
      {
        "name": "Stephen A. Baker",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2011-06-01",
    "categories": [
      "microstegium vimineum",
      "invasive species",
      "genetic structure",
      "founder effects",
      "secondary contact"
    ],
    "contents": "\n \n\nAbstract\nPatterns of spatial genetic structure produced following the expansion of an invasive species into novel habitats reflect demographic processes that have shaped the genetic structure we see today. We examined 359 individuals from 23 populations over 370 km within the James River Basin of Virginia, USA as well as four populations outside of the basin. Population diversity levels and genetic structure was quantified using several analyses. Within the James River Basin there was evidence for three separate introductions and a zone of secondary contact between two distinct lineages suggesting a relatively recent expansion within the basin. Microstegium vimineum possesses a mixed-mating system advantageous to invasion and populations with low diversity were found suggesting a recent founder event and self-fertilization. However, surprisingly high levels of diversity were found in some populations suggesting that out-crossing does occur. Understanding how invasive species spread and the genetic consequences following expansion may provide insights into the cause of invasiveness and can ultimately lead to better management strategies for control and eradication.\n\n\n\n",
    "preview": "manuscripts/baker-dyer-2011/featured.png",
    "last_modified": "2021-12-15T06:07:52-05:00",
    "input_file": {},
    "preview_width": 582,
    "preview_height": 470
  },
  {
    "path": "manuscripts/dyer-et-al-2010/",
    "title": "Landscape modelling of gene flow: improved power using conditional genetic distance derived from the topology of population networks",
    "description": "MOLECULAR ECOLOGY. 2010.",
    "author": [
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "John D. Nason",
        "url": {}
      },
      {
        "name": "Ryan C. Garrick",
        "url": {}
      }
    ],
    "date": "2010-09-01",
    "categories": [
      "gene flow",
      "genetic ovariance",
      "landscape genetics"
    ],
    "contents": "\n \n\nAbstract\nLandscape genetics is a burgeoning field of interest that focuses on how site-specific factors influence the distribution of genetic variation and the genetic connectivity of individuals and populations. In this manuscript, we focus on two methodological extensions for landscape genetic analyses: the use of conditional genetic distance (cGD) derived from population networks and the utility of extracting potentially confounding effects caused by correlations between phylogeographic history and contemporary ecological factors. Individual-based simulations show that when describing the spatial distribution of genetic variation, cGD consistently outperforms the traditional genetic distance measure of linearized F(ST) under both 1- and 2-dimensional stepping stone models and Cavalli-Sforza and Edward’s chord distance D(c) in 1-dimensional landscapes. To show how to identify and extract the effects of phylogeographic history prior to embarking on landscape genetic analyses, we use nuclear genotypic data from the Sonoran desert succulent Euphorbia lomelii (Euphrobiaceae), for which a detailed phylogeographic history has previously been determined. For E. lomelii, removing the effect of phylogeographic history significantly influences our ability to infer both the identity and the relative importance of spatial and bio-climatic variables in subsequent landscape genetic analyses. We close by discussing the utility of cGD in landscape genetic analyses.\n\n\n\n",
    "preview": "manuscripts/dyer-et-al-2010/featured.png",
    "last_modified": "2021-12-15T06:08:19-05:00",
    "input_file": {},
    "preview_width": 422,
    "preview_height": 541
  },
  {
    "path": "manuscripts/garrick-et-al-2010/",
    "title": "Nuclear gene phylogeography using PHASE: dealing with unresolved genotypes, lost alleles, and systematic bias in parameter estimation",
    "description": "BMC EVOLUTIONARY BIOLOGY. 2010.",
    "author": [
      {
        "name": "Ryan C. Garrick",
        "url": {}
      },
      {
        "name": "Paul Sunnucks",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2010-04-01",
    "categories": [],
    "contents": "\n \n\nAbstract\nBackground: A widely-used approach for screening nuclear DNA markers is to obtain sequence data and use bioinformatic algorithms to estimate which two alleles are present in heterozygous individuals. It is common practice to omit unresolved genotypes from downstream analyses, but the implications of this have not been investigated. We evaluated the haplotype reconstruction method implemented by PHASE in the context of phylogeographic applications. Empirical sequence datasets from five non-coding nuclear loci with gametic phase ascribed by molecular approaches were coupled with simulated datasets to investigate three key issues: (1) haplotype reconstruction error rates and the nature of inference errors, (2) dataset features and genotypic configurations that drive haplotype reconstruction uncertainty, and (3) impacts of omitting unresolved genotypes on levels of observed phylogenetic diversity and the accuracy of downstream phylogeographic analyses. Results: We found that PHASE usually had very low false-positives (i.e., a low rate of confidently inferring haplotype pairs that were incorrect). The majority of genotypes that could not be resolved with high confidence included an allele occurring only once in a dataset, and genotypic configurations involving two low-frequency alleles were disproportionately represented in the pool of unresolved genotypes. The standard practice of omitting unresolved genotypes from downstream analyses can lead to considerable reductions in overall phylogenetic diversity that is skewed towards the loss of alleles with larger-than-average pairwise sequence divergences, and in turn, this causes systematic bias in estimates of important population genetic parameters. Conclusions: A combination of experimental and computational approaches for resolving phase of segregating sites in phylogeographic applications is essential. We outline practical approaches to mitigating potential impacts of computational haplotype reconstruction on phylogeographic inferences. With targeted application of laboratory procedures that enable unambiguous phase determination via physical isolation of alleles from diploid PCR products, relatively little investment of time and effort is needed to overcome the observed biases.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:08:42-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/garrick-et-al-2010-con-gen/",
    "title": "Variable nuclear markers for a Sonoran Desert bark beetle, Araptus attenuatus Wood (Curculionidae: Scolytinae), with applications to related genera",
    "description": "CONSERVATION GENETICS. 2009.",
    "author": [
      {
        "name": "Ryan C. Garrick",
        "url": {}
      },
      {
        "name": "Crystal A. Meadows",
        "url": {}
      },
      {
        "name": "John D. Nason",
        "url": {}
      },
      {
        "name": "Anthony I. Cognato",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2009-08-01",
    "categories": [
      "baja california",
      "codominant loci",
      "coleoptera",
      "introns",
      "population structure"
    ],
    "contents": "\n\n\nAbstract\nWe report eight new co-dominant nuclear markers for population genetics of the bark beetle Araptus attenuatus Wood. Several loci include introns from low-copy genes, and four cross-amplify in one or more related genera. The markers show moderate levels of polymorphism (2-19 alleles per locus), and no loci showed significant deviations from Hardy-Weinberg or linkage equilibrium across both of the two populations examined, consistent with Mendelian inheritance patterns.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:08:40-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/garrick-et-al-2009-mol-ecol/",
    "title": "Not just vicariance: phylogeography of a Sonoran Desert euphorb indicates a major role of range expansion along the Baja peninsula",
    "description": "MOLECULAR ECOLOGY. 2009.",
    "author": [
      {
        "name": "Ryan C. Garrick",
        "url": {}
      },
      {
        "name": "John D. Nason",
        "url": {}
      },
      {
        "name": "Crystal A. Meadows",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2009-05-01",
    "categories": [
      "baja california",
      "euphorbia",
      "landscape history",
      "population structure",
      "statistical phylogeography"
    ],
    "contents": "\n \n\nAbstract\nTo examine the generality of population-level impacts of ancient vicariance identified for numerous arid-adapted animal taxa along the Baja peninsula, we tested phylogeographical hypotheses in a similarly distributed desert plant, Euphorbia lomelii (Euphorbiaceae). In light of fossil data indicating marked changes in the distributions of Baja floristic assemblages throughout the Holocene and earlier, we also examined evidence for range expansion over more recent temporal scales. Two classes of complementary analytical approaches hypothesis-testing and hypothesis-generating were used to exploit phylogeographical signal from chloroplast DNA sequence data and genotypic data from six codominant nuclear intron markers. Sequence data are consistent with a scenario of mid-peninsular vicariance originating c. 1 million years ago (Ma). Alternative vicariance scenarios representing earlier splitting events inferred for some animals (e.g. Isthmus of La Paz inundation, c. 3 Ma; Sea of Cortez formation, c. 5 Ma) were rejected. Nested clade phylo-geographical analysis corroborated coalescent simulation-based inferences. Nuclear markers broadened the temporal spectrum over which phylogeographical scenarios could be addressed, and provided strong evidence for recent range expansions along the north-south axis of the Baja peninsula. In contrast to previous plant studies in this region, however, the expansions do not appear to have been in a strictly northward direction. These findings contribute to a growing appreciation of the complexity of organismal responses to past climatic and geological changes even when taxa have evolved in the same landscape context.\n\n\n\n",
    "preview": "manuscripts/garrick-et-al-2009-mol-ecol/featured.png",
    "last_modified": "2021-12-15T06:08:39-05:00",
    "input_file": {},
    "preview_width": 329,
    "preview_height": 512
  },
  {
    "path": "manuscripts/dyer-2009/",
    "title": "GeneticStudio: a suite of programs for spatial analysis of genetic-marker data",
    "description": "MOLECULAR ECOLOGY RESOURCES. 2009.",
    "author": [
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2009-01-01",
    "categories": [
      "genetic structure",
      "population graphs",
      "spatial structure"
    ],
    "contents": "\n \n\nAbstract\nThe analysis of genetic marker data is increasingly being conducted in the context of the spatial arrangement of strata (e.g. populations) necessitating a more flexible set of analysis tools. GeneticStudio consists of four interacting programs: (i) Geno a spreadsheet-like interface for the analysis of spatially explicit marker-based genetic variation; (ii) Graph software for the analysis of Population Graph and network topologies, (iii) Manteller, a general purpose for matrix analysis program; and (iv) SNPFinder, a program for identifying single nucleotide polymorphisms. The GeneticStudio suite is available as source code as well as binaries for OSX and Windows and is distributed under the GNU General Public License.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:08:11-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/garrick-et-al-2008-con-gen/",
    "title": "A set of polymorphic nuclear intron markers for conservation genetics and phylogeography of Euphorbia species (Pedilanthus clade)",
    "description": "CONSERVATION GENETICS. 2008.",
    "author": [
      {
        "name": "Ryan C. Garrick",
        "url": {}
      },
      {
        "name": "Crystal A. Meadows",
        "url": {}
      },
      {
        "name": "Antoine N. Nicolas",
        "url": {}
      },
      {
        "name": "John D. Nason",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2008-12-01",
    "categories": [
      "codominant loci",
      "euphorbiaceae",
      "population structure",
      "phylogeny",
      "sonoran desert"
    ],
    "contents": "\n \n\nAbstract\nWe developed seven nuclear intron markers for Euphorbia lomelii. New exon-primed intron-crossing (EPIC) oligonucleotides were used for initial amplification and sequencing, then locus-specific primers and restriction-fragment-length polymorphism genotyping assays were designed. Loci showed no significant deviation from Hardy-Weinberg and linkage equilibrium, and they cross-amplify in at least three congeneric species.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:08:35-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/garrick-et-al-2008-mol-ecol/",
    "title": "Babies and bathwater: a comment on the premature obituary for nested clade phylogeographical analysis",
    "description": "MOLECULAR ECOLOGY. 2008.",
    "author": [
      {
        "name": "Ryan C. Garrick",
        "url": {}
      },
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      },
      {
        "name": "LB. Beheregaray",
        "url": {}
      },
      {
        "name": "Paul Sunnucks",
        "url": {}
      }
    ],
    "date": "2008-03-01",
    "categories": [
      "cross-validation",
      "hypothesis testing",
      "integrative analyses",
      "multiple loci"
    ],
    "contents": "\n \n\nAbstract\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:08:37-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/dyer-2007/",
    "title": "Powers of discerning: challenges to understanding dispersal processes in natural populations",
    "description": "MOLECULAR ECOLOGY. 2007.",
    "author": [
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2007-12-01",
    "categories": [],
    "contents": "\n \n\nAbstract\nIn this issue of Molecular Ecology, authors Robledo-Arnuncio & Garcia present a compelling approach for quantifying seed dispersal in plant populations. Building upon methods previously used for quantification of pollen dispersal, the authors not only examine the behaviour of the model with respect to sample sizes, dispersal distance, and the kurtosis of the dispersal function but also provide an empirical example using Prunus mahaleb.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:08:09-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/dyer-2007-tpb/",
    "title": "The evolution of genetic topologies",
    "description": "THEORETICAL POPULATION BIOLOGY. 2007.",
    "author": [
      {
        "name": "Rodney J. Dyer",
        "url": "https://dyerlab.org"
      }
    ],
    "date": "2007-02-01",
    "categories": [
      "population graphs",
      "genetic structure",
      "isolation by distance",
      "graph theory",
      "centrality",
      "graph diameter"
    ],
    "contents": "\n \n\nAbstract\nThis manuscript explores the simultaneous evolution of population genetic parameters and topological features within a population graph through a series of Monte Carlo simulations. I show that node centrality and graph breadth are significantly correlated to population genetic parameters Phi(ST) and M (p = -0.95; p = -0.98, respectively), which are commonly used in quantifying among population genetic structure and isolation by distance. Next, the topological consequences of migration patterns are examined by contrasting N-island and stepping stone models of gene movement. Finally, I show how variation in migration rate influences the rate of formation of specific topological features with particular emphasis to the phase transition that occurs when populations begin to become fixed due to restricted movement of genes among populations. I close by discussing the utility of this method for the analysis of intraspecific genetic variation. (c) 2006 Elsevier Inc. All rights reserved.\n\n\n\n",
    "preview": "manuscripts/dyer-2007-tpb/featured.png",
    "last_modified": "2021-12-15T06:08:07-05:00",
    "input_file": {},
    "preview_width": 1732,
    "preview_height": 1356
  },
  {
    "path": "manuscripts/gonzales-et-al-2006/",
    "title": "Pollen-mediated gene dispersal within continuous and fragmented populations of a forest understorey species, Trillium cuneatum",
    "description": "MOLECULAR ECOLOGY. 2006.",
    "author": [
      {
        "name": "Eva Gonzales",
        "url": {}
      },
      {
        "name": "James L Hamrick",
        "url": {}
      },
      {
        "name": "Peter E Smouse",
        "url": {}
      },
      {
        "name": "Rodney J Dyer",
        "url": {}
      }
    ],
    "date": "2006-07-01",
    "categories": [
      "fragmentation",
      "pollen gene flow",
      "trillium",
      "twogener"
    ],
    "contents": "\n\n\nAbstract\nPollen movement plays a critical role in the distribution of genetic variation within and among plant populations. Direct measures of pollen movement in the large, continuous populations that characterize many herbaceous plant species are often technically difficult and biologically unreliable. Here, we studied contemporary pollen movement in four large populations of Trillium cuneatum. Three populations, located in the Georgia Piedmont, are exposed to strong anthropogenic disturbances, while the fourth population, located in the Southern Appalachian Mountains, is relatively undisturbed. Using the recently developed 2Gener analysis, we extracted estimates of the effective number of pollen donors (N-ep), effective mating neighbourhood size (A(ep)) and the average distance of pollen movement (delta) for each population. We extended the 2Gener method by developing inference on the paternal gametic contribution to the embryo in situations where offspring genotypes are inferred from seeds and elaiosomes of species with bisporic megagametogenesis. Our estimates indicate that maternal plants do not sample pollen randomly from a global pool; rather, pollen movement in all four populations is highly restricted. Although the effective number of pollen donors per maternal plant is low (1.22-1.66) and pollen movement is highly localized in all populations, N-ep in the disturbed Piedmont populations is higher and there is more pollen movement than in the mountains. The distance pollen moves is greater in disturbed sites and fragmented populations, possibly due to edge effects in Trillium habitats.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:08:51-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/dyer-2005/",
    "title": "GENER: a server-based analysis of pollen pool structure",
    "description": "MOLECULAR ECOLOGY NOTES. 2005.",
    "author": [
      {
        "name": "Rodney Dyer",
        "url": {}
      }
    ],
    "date": "2005-12-01",
    "categories": [
      "gene flow",
      "pollen structure",
      "two-generation analysis"
    ],
    "contents": "\n \n\nAbstract\nThe server-based program GENER performs the two-generation analysis of pollen flow for data consisting of mother/offspring arrays using genetic markers. The GENER program decomposes the genetic variance sampled by maternal individuals within and among pollen pool components of genetic variance and is accessible from http://dyerlab.bio.vcu.edu. These estimates are used to construct the test statistic, Phi(FT), whose significance is tested via permutation. The Phi(FT) statistic can subsequently be used to quantify genetic effective pollen donor population size (N-ep), effective mating area and dispersal distance. Furthermore, the GENER program can calculate Phi(FT) values for all pairs of substrata within the data set.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:08:06-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/sork-et-al-2005/",
    "title": "A two-generation analysis of pollen pool genetic structure in flowering dogwood, Cornus florida (Cornaceae), in the Missouri Ozarks",
    "description": "AMERICAN JOURNAL OF BOTANY. 2005.",
    "author": [
      {
        "name": "Victoria L Sork",
        "url": {}
      },
      {
        "name": "Peter E Smouse",
        "url": {}
      },
      {
        "name": "Victoria J Apsit",
        "url": {}
      },
      {
        "name": "Rodney J Dyer",
        "url": {}
      },
      {
        "name": "Robert D Westfall",
        "url": {}
      }
    ],
    "date": "2005-02-01",
    "categories": [
      "california",
      "cornaceae",
      "gene flown",
      "genetic structure",
      "landscape change",
      "pollen movement",
      "silvicultural treatment",
      "2gener"
    ],
    "contents": "\n\n\nAbstract\nAnthropogenic landscape change can disrupt gene flow. As part of the Missouri Ozark Forest Ecosystem Project, this study examined whether silvicultural practices influence pollen-mediated gene movement in the insect-pollinated species, Cornus florida L., by comparing pollen pool structure (Phi(st)) among clear-cutting, selective cutting, and uncut regimes with the expectation that pollen movement should be least in the uncut regime. Using a sample of 1500 seedlings - 10 each from 150 seed parents (43 in clear-cut, 74 in selective, and 33 in control sites) from six sites (each ranging from 266 to 527 ha), eight allozyme loci were analyzed with a pollen pool structure approach known as 2Gener (Smouse et al., 2001; Evolution 55: 260-271). This analysis revealed that pollen pool structure was less in clear-cut ((Phi) over circle (C) = 0.090, P < 0.001) than in uncut areas ((Phi) over cap (U) = 0.174, P < 0.001), with selective-cut intermediate ((Phi) over circles = 0.125, P < 0.001). These estimates translate into more effective pollen donors (N(ep)) in clear-cut (N(ep) = 5.56) and selective-cut (N(ep) = 4.00) areas than in uncut areas (N(ep) = 2.87). We demonstrate that Phi(C) less than or equal to Phi(S) less than or equal to Phi(U), with (Phi) over circle (C), significantly smaller than (Phi) over circle (U) (P < 0.034). The findings imply that, as long as a sufficiently large number of seed parents remain to provide adequate reproduction and to avoid a genetic bottleneck in the effective number of mothers, silvicultural management may not negatively affect the effective number of pollen parents, and hence subsequent genetic diversity in Cornus florida.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:09:07-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/dyer-nason-2004/",
    "title": "Population Graphs: the graph theoretic shape of genetic structure",
    "description": "MOLECULAR ECOLOGY. 2004.",
    "author": [
      {
        "name": "RJ Dyer",
        "url": {}
      },
      {
        "name": "JD Nason",
        "url": {}
      }
    ],
    "date": "2004-07-01",
    "categories": [
      "genetic structure",
      "graph theory",
      "networks",
      "phylogeography"
    ],
    "contents": "\n \n\nAbstract\nPatterns of intraspecific genetic variation result from interactions among both historical and contemporary evolutionary processes. Traditionally, population geneticists have used methods such as F-statistics, pairwise isolation by distance models, spatial autocorrelation and coalescent models to analyse this variation and to gain insight about causal evolutionary processes. Here we introduce a novel approach (Population Graphs) that focuses on the analysis of marker-based population genetic data within a graph theoretic framework. This method can be used to estimate traditional population genetic summary statistics, but its primary focus is on characterizing the complex topology resulting from historical and contemporary genetic interactions among populations. We introduce the application of Population Graphs by examining the range-wide population genetic structure of a Sonoran Desert cactus (Lophocereus schottii). With this data set, we evaluate hypotheses regarding historical vicariance, isolation by distance, population-level assignment and the importance of specific populations to species-wide genetic connectivity. We close by discussing the applicability of Population Graphs for addressing a wide range of population genetic and phylogeographical problems.\n\n\n\n",
    "preview": "manuscripts/dyer-nason-2004/featured.png",
    "last_modified": "2021-12-15T06:08:22-05:00",
    "input_file": {},
    "preview_width": 768,
    "preview_height": 451
  },
  {
    "path": "manuscripts/dyer-et-al-2004/",
    "title": "Two-generation analysis of pollen flow across a landscape V: a stepwise approach for extracting factors contributing to pollen structure",
    "description": "HEREDITY. 2004.",
    "author": [
      {
        "name": "RJ Dyer",
        "url": {}
      },
      {
        "name": "RD Westfall",
        "url": {}
      },
      {
        "name": "VL Sork",
        "url": {}
      },
      {
        "name": "PE Smouse",
        "url": {}
      }
    ],
    "date": "2004-03-01",
    "categories": [
      "pollen movement",
      "2gener",
      "gene flow",
      "stamova"
    ],
    "contents": "\n \n\nAbstract\nPatterns of pollen dispersal are central to both the ecology and evolution of plant populations. However, the mechanisms controlling either the dispersal process itself or our estimation of that process may be influenced by site-specific factors such as local forest structure and nonuniform adult genetic structure. Here, we present an extension of the AMOVA model applied to the recently developed 2Gener analysis of pollen pool structure. This model, dubbed the Stepwise AMOVA (StAMOVA), focuses on determining to what extent ecological, demographic, and/or environmental factors influence the observed genetic variation in spatially separated pollen pools. The analysis is verified for efficacy, using an extensive battery of simulations, illustrating: ( 1) how nonuniform adult genetic structure influences the differentiation of spatially separated pollen pools, and ( 2) how effectively the Stepwise analysis performs in carrying out the appropriate corrections. Finally, the model is applied to a Quercus alba data set, from which we have prior evidence that the adult genetic structure is nonuniformly distributed across the sampling landscape. From this data set, we show how the Stepwise model can be applied to remove the effects of spatial adult genetic structure on pollen pool differentiation and contrast these results with those derived from the original 2Gener analysis.\n\n\n\n",
    "preview": "manuscripts/dyer-et-al-2004/featured.png",
    "last_modified": "2021-12-15T06:08:17-05:00",
    "input_file": {},
    "preview_width": 676,
    "preview_height": 380
  },
  {
    "path": "manuscripts/sork-et-al-2002/",
    "title": "Pollen movement in declining populations of California Valley oak, Quercus lobata: where have all the fathers gone?",
    "description": "MOLECULAR ECOLOGY. 2002.",
    "author": [
      {
        "name": "Victoria L Sork",
        "url": {}
      },
      {
        "name": "Frank W Davis",
        "url": {}
      },
      {
        "name": "Peter E Smouse",
        "url": {}
      },
      {
        "name": "Victoria J Apsit",
        "url": {}
      },
      {
        "name": "Rodney J Dyer",
        "url": {}
      },
      {
        "name": "Juan F Fernandez",
        "url": {}
      },
      {
        "name": "B Kuhn",
        "url": {}
      }
    ],
    "date": "2002-09-01",
    "categories": [
      "california valley oak",
      "genetic isolation",
      "pollen flow",
      "quercus lobata",
      "2gener"
    ],
    "contents": "\n\n\nAbstract\nThe fragmented populations and reduced population densities that result from human disturbance are issues of growing importance in evolutionary and conservation biology. A key issue is whether remnant individuals become reproductively isolated. California Valley oak (Quercus lobata ) is a widely distributed, endemic species in California, increasingly jeopardized by anthropogenic changes in biota and land use. We studied pollen movement in a savannah population of Valley oak at Sedgwick Reserve, Santa Barbara County, to estimate effective number of pollen donors (N (ep) ) and average distance of effective pollen movement (delta). Using twogener, our recently developed hybrid model of paternity and genetic structure treatments that analyses maternal and progeny multilocus genotypes, we found that current N (ep) = 3.68 individuals. Based on an average adult density of d = 1.19 stems/ha, we assumed a bivariate normal distribution to model current average pollen dispersal distance (delta) and estimated delta= 64.8 m. We then deployed our parameter estimates in spatially explicit models of the Sedgwick population to evaluate the extent to which N (ep) may have changed, as a consequence of progressive stand thinning between 1944 and 1999. Assuming that pollen dispersal distance has not changed, we estimate N (ep) was 4.57 individuals in 1944, when stand density was 1.48. Both estimates indicate fewer effective fathers than one might expect for wind-pollinated species and fewer than observed elsewhere. The results presented here provide a basis for further refinements on modelling pollen movement. If the trends continue, then ongoing demographic attrition could further reduce neighbourhood size in Valley oak resulting in increased risk of reproductive failure and genetic isolation.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:09:05-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/kelly-dyer-2002/",
    "title": "Demographic consequences of inflorescence-feeding insects for Liatris cylindracea, an iteroparous perennial",
    "description": "OECOLOGIA. 2002.",
    "author": [
      {
        "name": "Carol A Kelly",
        "url": {}
      },
      {
        "name": "Rodney J Dyer",
        "url": {}
      }
    ],
    "date": "2002-08-01",
    "categories": [
      "experimental insect exclusion",
      "individual-based population models",
      "inflorescence-feeding insects",
      "iteroparous perennial",
      "population growth rate"
    ],
    "contents": "\n \n\nAbstract\nWhile floral herbivores and predispersal seed predators often reduce plant reproductive output, their role in limiting plant fitness and population growth is less clear, especially for iteroparous perennial plant species. In this study we experimentally excluded floral herbivores and predispersal seed predators (insecticide spray versus water control) over a 2-year period to examine the effect of inflorescence-feeding insects on levels of seed production, seedling emergence, and juvenile establishment for Liatris cylindracea, an iteroparous perennial plant. In addition, we collected detailed demographic data on all life stage transitions for an additional set of individuals in the same population over 4 years. We used the experimental and demographic data to construct stochastic individual-based simulations to evaluate the overall effect of inflorescence-feeding insects on adult recruitment per maternal plant (a fitness component) and population growth rate. The insect exclusion experiments showed that damage due to insects decreased seed production, seedling emergence, and juvenile establishment for both years’ experiments. These results indicate that recruitment was seed-limited through juvenile establishment, and that inflorescence-feeding insects influenced the degree of seed limitation. Results of the individual-based simulation models, which included individual demographic and temporal stochasticity, showed that inflorescence-feeding insects negatively affected the number of adult offspring per maternal plant recruited into the population and population growth rate for both years’ experiments. Taken together, the results of the experimental exclusions and the individual-based models indicate that inflorescence-feeding insects can influence population growth rate, and have the potential to act as a selective force for the evolution of traits in this plant species.\n\n\n\n",
    "preview": "manuscripts/kelly-dyer-2002/featured.jpg",
    "last_modified": "2021-12-15T06:08:53-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/apsit-et-al-2002/",
    "title": "Patterns of mating in an insect-pollinated tree species in the Missouri Ozark Forest Ecosystem Project",
    "description": "PROCEEDINGS OF THE SECOND MISSOURI OZARK FOREST ECOSYSTEM PROJECT SYMPOSIUM - POST-TREATMENT RESULTS OF THE LANDSCAPE EXPERIMENT. 2002.",
    "author": [
      {
        "name": "Victoria Apsit",
        "url": {}
      },
      {
        "name": "Rodney Dyer",
        "url": {}
      },
      {
        "name": "Victoria Sork",
        "url": {}
      }
    ],
    "date": "2002-01-01",
    "categories": [],
    "contents": "\nAbstract\nContemporary gene flow is a major mechanism for the maintenance of genetic diversity. One component of gene flow is the mating system, which is a composite measure of selfing, mating with relatives, and outcrossing. Although both gene flow and mating patterns contribute to the ecological sustainability of populations, a focus of many forest management plans, these processes are often overlooked in forest management studies. As part of the Missouri Ozark Forest Ecosystem Project (MOFEP) we conducted a study of mating patterns in flowering dogwood (Cornus florida L), an insect-pollinated tree that is abundant and ubiquitous under story tree of upland Missouri Ozark forests. In 1998 and 1999, we collected fruit from over 200 Cornus florida individuals located in six compartments (MOFEP sites 1-6; similar to250-500 ha each), which were subjected to one of three management treatments: even-aged, uneven-aged, and no harvest. To see whether the management treatments influenced tree density surrounding the study trees, we measured and compared tree density across treatments. Because differential germination could reflect either genetic or environmental factors affecting the mating system, we measured germination success on a per maternal tree basis. We then measured the outcrossing rate, the rate of consanguineous mating (mating with relatives), and the effective number of pollen donors for each of the six sites and tested the hypotheses that both treatment and local tree density have no influence on these aspects of mating. Furthermore, the percent germination among mothers was not significantly influenced by the application of forest treatments. Multilocus outcrossing, t(m) (range 0.981-1.000), single locus outcrossing, t(s) (range 0.976-0.996), and the genetic effective number of pollen donors (range 4-11) did not differ among management treatments. For 1998, mating with relatives tended to increase with local density (df=1,28, F=4.07, P=0.053, 1998 only), suggesting local familial structure at the site level. No trend in consanguineous mating was observed in the data collected in 1999. The overall results show that the first cycle of timber harvesting had little effect on insect-mediated pollen movement in C. florida This lack of impact could be due to the fact that the treatments did not alter pollinator behavior. Thus, to evaluate the general impact of forest management on gene flow and mating in woody plants, we recommend ongoing monitoring as management treatments are continued and further studies on additional plant species.\n\n\n\n",
    "preview": {},
    "last_modified": "2021-12-15T06:07:49-05:00",
    "input_file": {}
  },
  {
    "path": "manuscripts/dyer-sork-2001/",
    "title": "Pollen pool heterogeneity in shortleaf pine, Pinus echinata Mill.",
    "description": "MOLECULAR ECOLOGY. 2001.",
    "author": [
      {
        "name": "Rodney J Dyer",
        "url": {}
      },
      {
        "name": "Victoria L Sork",
        "url": {}
      }
    ],
    "date": "2001-04-01",
    "categories": [
      "cpssr",
      "density",
      "genetic",
      "pinus",
      "pollen",
      "structure"
    ],
    "contents": "\n \n\nAbstract\nPollen is the dominant vector of gamete exchange for most temperate tree species. Because pollen movement influences the creation, maintenance and erosion of genetic structure in adult populations, it is important to understand what factors influence the process of pollen movement. Isolation by distance in pollen donor populations can create highly structured pollen polls by increased sampling of local fathers. Extrinsic factors, such as the intervening vegetative structure and local pollen donor densities, can also influence the genetic composition of local. pollen pools. Using paternally inherited chloroplast microsatellite markers, we examined the structure and diversity of pollen pools in Pinus echinata Mill. in southern Missouri, USA. Our analysis is based on a multivariate AMOVA analysis of stands (approximate to1 ha; six per region) nested within regions (approximate to 800 ha; four each). Significant multilocus structure of the pollen pool within regions (phi (SR) = 0.095), but not among regions (phi (RT) = 0.010), indicates that pollen movement is relatively restricted. Furthermore, the significant correlation between pairwise genetic and physical distances (Mantel correlation; rho = 0.32) provided support for the isolation by distance hypothesis. Our results indicated that availability of pollen donors did not affect diversity of the pollen pool, measured by the number of unique multilocus genotypes at each stand. However, pollen pool diversity was negatively associated with vegetative structure, measured as total forest tree density. Our findings indicated that on-going pollen movement within continuous forest is relatively restricted as a result of both isolation by distance and vegetative structure.\n\n\n\n",
    "preview": "manuscripts/dyer-sork-2001/featured.png",
    "last_modified": "2021-12-15T06:08:24-05:00",
    "input_file": {},
    "preview_width": 1700,
    "preview_height": 1128
  },
  {
    "path": "manuscripts/smouse-et-al-2001/",
    "title": "Two-generation analysis of pollen flow across a landscape. I. Male gamete heterogeneity among females",
    "description": "EVOLUTION. 2001.",
    "author": [
      {
        "name": "Peter E Smouse",
        "url": {}
      },
      {
        "name": "Rodney J Dyer",
        "url": {}
      },
      {
        "name": "Robert D Westfall",
        "url": {}
      },
      {
        "name": "Victoria L Sork",
        "url": {}
      }
    ],
    "date": "2001-02-01",
    "categories": [
      "amova",
      "gene flow",
      "genetic structure",
      "parentage analysis",
      "phi statistics",
      "pollen movement",
      "quercus alba",
      "2gener"
    ],
    "contents": "\n\n\nAbstract\nGene flow is a key factor in the spatial genetic structure in spatially distributed species. Evolutionary biologists interested in microevolutionary processes and conservation biologists interested in the impact of landscape change require a method that measures the real time process of gene movement. We present a novel two-generation (parent-offspring) approach to the study of genetic structure (TwoGener) that allows us to quantify heterogeneity among the male gamete pools sampled by maternal trees scattered across the landscape and to estimate mean pollination distance and effective neighborhood size. First, we describe the model’s elements: genetic distance matrices to estimate intergametic distances, molecular analysis of variance to determine whether pollen profiles differ among mothers, and optimal sampling considerations. Second, we evaluate the model’s effectiveness by simulating spatially distributed populations. Spatial heterogeneity in male gametes can be estimated by Phi (FT), a male gametic analogue of Wright’s F(ST) and an inverse function of mean pollination distance. We illustrate TwoGener in cases where the male gamete can be categorically or ambiguously determined. This approach does not require the high level of genetic resolution needed by parentage analysis, but the ambiguous case is vulnerable to bias in the absence of adequate genetic resolution. Finally, we apply TwoGener to an empirical study of Quercus alba in Missouri Ozark forests. We find that Phi (FT) = 0.06, translating into about eight effective pollen donors per female and an effective pollination neighborhood as a circle of radius about 17 m. Effective pollen movement in Q. alba is more restricted than previously realized, even though pollen is capable of moving large distances. This case study illustrates that, with a modest investment in field survey and laboratory analysis, the TwoGener approach permits inferences about landscape-level gene movements.\n\n\n\n",
    "preview": "manuscripts/smouse-et-al-2001/featured.jpg",
    "last_modified": "2021-12-15T06:09:03-05:00",
    "input_file": {}
  }
]
